---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.UndefinedConnector
source: html/b9e8391d-9f78-cf81-c197-811f01a4ba63.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.UndefinedConnector Property

Revit does not support Undefined connectors. The following have been replaced by the default connector: [Connector Element]

## Syntax (C#)
```csharp
public static FailureDefinitionId UndefinedConnector { get; }
```